import { Component } from '@angular/core';
import { IonicPage, NavController, NavParams } from 'ionic-angular';

/**
 * Generated class for the ShakambariMahamantraPage page.
 *
 * See https://ionicframework.com/docs/components/#navigation for more info on
 * Ionic pages and navigation.
 */

@IonicPage()
@Component({
  selector: 'page-shakambari-mahamantra',
  templateUrl: 'shakambari-mahamantra.html',
})
export class ShakambariMahamantraPage {

  mahamantra ;

  constructor(public navCtrl: NavController, public navParams: NavParams) {

    this.mahamantra = [
      {title : ' माँ ब्रम्हाणी नमो नमः, हे रुद्राणी नमो नमः, सकरायवासिणी नमो नमः, शाकंभरी माँ नमोस्तुतेः'},
      {title : 'मात सताक्षी नमो नमः, दुर्गमविनाशिणी नमो नमः, हे सुखराशी नमो नमः, शाकंभरी माँ नमोस्तुतेः,माँ ब्रम्हाणी.'},
      {title : 'संकटहरणी नमो नमः, कष्टनिवारणी नमो नमः, माँ भवतारणी नमो नमः, शाकंभरी माँ नमोस्तुतेः,माँ ब्रम्हाणी..'},
      {title : 'हे जग जननी नमो नमः, कामनापुरणी नमो नमः, सोम्यरुपेणी नमो नमः, शाकंभरी माँ नमोस्तुतेः,माँ ब्रम्हाणी..'},
      {title : 'हे परमेश्वरी नमोनमः, त्रिपुरसुंदरी नमो नमः, हे बिश्वेशरी माँ नमो नमः, शाकंभरी माँ नमोस्तुतेः,माँ ब्रम्हाणी...'},
      {title : 'दुर्गारुपेणी नमो नमः, लक्ष्मीरुपेणी नमो नमः, विद्यारुपेणी नमो नमः, शाकंभरी माँ नमोस्तुतेः,माँ ब्रम्हाणी..'},
      {title : 'भुवनवंदिनी नमो नमः, धरानिकंदणी नमो नमः, सिंहवाहीणी नमो नमः, शाकंभरी माँ नमोस्तुतेः,माँ ब्रम्हाणी..'},
      {title : 'शक्तीस्वरुपा नमो नमः, हे भवभुपा नमो नमः, अनंत अनुपा नमो नमः, शाकंभरी माँ नमोस्तुतेः,माँ ब्रम्हाणी....'},
      {title : 'अतीसुखदायणी नमो नमः, करुणानयणी नमो नमः, हे वरदायणी नमो नमः, शाकंभरी माँ नमोस्तुतेः,माँ ब्रम्हाणी...'},
      {title : 'मंगलकरणी नमो नमः, अमंगलहरणी नमो नमः, अभयावरणी नमो नमः शाकंभरी माँ नमोस्तुतेः,माँ ब्रम्हाणी....'},
      {title : 'सुरधाम निवासिणी नमो नमः, हे अविलाशिणी नमो नमः, दैत्यविनाशिणी नमो नमः, शाकंभरी माँ नमोस्तुतेः,माँ ब्रम्हाणी....'},
      {title : 'शेल्यपुत्री नमो नमः, ब्रम्हचारणी नमो नमः, चंद्रघंटा नमो नमः, शाकंभरी माँ नमोस्तुतेः,माँ ब्रम्हाणी....'},
      {title : 'मातशमांडा नमो नमः, स्कंद माता नमो नमः, हे कात्यायणी नमो नमः, शाकंभरी माँ नमोस्तुतेः,माँ ब्रम्हाणी....'},
      {title : 'कालरात्री नमो नमः, हे महागौरी नमो नमः, सिद्धीदात्री नमो नमः, शाकंभरी माँ नमोस्तुतेः,माँ ब्रम्हाणी....'},
      {title : 'हे करुणामई नमो नमः, हे ममतामई नमो नमः, भक्तवत्सला नमो नमः, शाकंभरी माँ नमो नमः,माँ ब्रम्हाणी....'},
      {title : 'माँ ब्रम्हाणी नमो नमः, हे रुद्राणी नमो नमः, सकरायवासिणी नमो नमः, शाकंभरी माँ नमोस्तुतेः, हे ब्रम्हाणी....'},
    ]
  }

  ionViewDidLoad() {
    console.log('ionViewDidLoad ShakambariMahamantraPage');
  }

}
