{
    "temple": [
        {
            "topic": "History Of Temple",
            "details": [
                {
                    "detail": "Sri Shakambari Temple is situated in Sakarai Dham, which is near Udaipurwati in Rajasthan. The idols here are of Brahmani and Rudrani. Both the idols are lion riding goddesses inthe posture of killing Mahishasura. They both are eight armed.Their faces are Vermillion pasted. The only difference between the two is of the stone. That of Brahmani is made of marble while that of Rudrani is made of locally available medstone. Sadhus of Nath cult have been the priests of this temple.The Shikhar of the temple bear highly artistic statuettes of gods and goddesses. On aplatform of the elegantly hewn stones is placed a silver throne with drawn patterns thereon. This is the seat for the deities. Mandapa or the prayer portico was initially built inthe Vikram Samvat 699 (647 A.D.). Afterwards in 11th and 12th centuries it was repairedand renovated. The present edifice came is this shape in the Vikram Samvat 1970 (1913 A.D.). The work was accomplished on the 7th day of bright half of Vaisakha in Samvat1980 (1923 A.D.). The huge temple in its present form was built by Seth Ram GopalDangayach and his family.",
                    "img": "$25"
                }
            ]
        },
        {
            "topic": "History of Mataji",
            "details": [
                {
                    "detail": "Shakambari Mata, Sakarai, RajasthanThe Demon Durgam had acquired all four books of total knowledge (The Veda) from Lord Brahma through penance. He also received a boon from Lord Brahma that caused all the pujas, yajnas and havis that were offered to the gods to reach him instead, making him invincible. Durgam became very arrogant and started tormenting the whole world. As a consequence, it did not rain for one hundred years and the whole world was hit by a very severe drought. The rishis and munis took refuge in the caves of the Himalayas, and meditated upon the Supreme Devi. The Goddess appeared in front of them bearing a wonderful form. She had countless eyes that gave her the name Shatakshi, and was carrying grain, cereals, vegetables, greens, fruits and other herbs and because of this was called Shakambhari. The goddess was so moved by their plight that tears rolled down from her eyes for nine continuous days and nights. The tears became a river, which ended the drought. The rishis and munis and the gods then requested that she recover the Vedas, which were in possession of Durgam. Durgam discovered through his messengers that people were living happily and immediately attacked with a large army. The goddess protected the frail rishis, munis, gods and others by putting up a huge wall of fire around them, and then let her discus hover around it. There ensued a tremendous battle between the Devi and Durgam. From her body manifested the ten most powerful powers who had never been in the universe before Dashamahaavidya and 64,000 other goddesses. At last the goddess Shatakshi/Shakambhari killed Durgam with her trident and recovered the Vedas from his possession. At that very moment all the mantras and japas that the rishis, munis and gods had performed earlier but had been absorbed by the demon Durgam transformed into the bright light of a 10,000 suns and entered the Devi. She then handed over the Vedas to the deities. Ishwari is also knowns as Durga because she killed the demon Durgam. The story of Shakambhari is told in Chapter 28 of the Devi Bhagavatam Purana, titled, On the glory of Shatakshi Devi. Also, in The Devi Mahatmyam, her story is told in Chapter 11 and in the artha murti rahasyam (The Secret of the Manifestations) an addendum to the Devi Mahatmyam.",                    
                    "img": "$25"
                }
            ]
        },

        {
            "topic": "About Mahantji",
            "details": [
                {
                    "detail": "Presently mandir is taken care by Sri Mahantji Dayanathji. Mahantji takes care of Mataji Seva, Mandir Administration, Gaushala and all other related activities of the temple. His kind & dedicated services towards devotees makes the visit most memorable for everybody.",                    
                    "img": "$25"
                }
            ]
        },

        {
            "topic": "Mataji Poshak Size",
            "details": [
                {
                    "detail": "",
                     "img": "$25"
                }
            ]
        },

        {
            "topic": "How to Reach",
            "details": [
                {
                    "detail": "",
                     "img": "$25"
                }
            ]
        },
        {
            "topic": "Local Transport",
            "details": [
                {
                    "detail": "",
                     "img": "$25"
                }
            ]
        }
        
    ]
}